[
  {
    "id": 1,
    "companyLogo": "google.png",
    "jobTitle": "Software Engineer",
    "companyName": "Google",
    "remoteOrOnsite": "Remote",
    "location": "Mountain View, CA",
    "fulltimeOrPartTime": "Full-time",
    "salary": "$120,000 - $200,000",
    "jobDescription": "We are looking for an experienced Software Engineer to join our team. The ideal candidate will have a strong background in software development, with expertise in programming languages such as Java, Python, or C++. You will work on a variety of projects, from designing and developing new software products to maintaining and improving existing applications. Strong communication skills and the ability to work collaboratively with cross-functional teams are essential.",
    "jobResponsibility": "As a Software Engineer, you will be responsible for designing, developing, and maintaining software applications and systems. You will collaborate with cross-functional teams to gather requirements and design solutions, write clean, efficient, and well-documented code, and test and debug software to ensure high-quality and reliable products. You should have a strong background in software development, with expertise in programming languages such as Java, Python, or C++. Strong communication skills and the ability to work collaboratively with cross-functional teams are essential.",
    "educationalRequirements": "Bachelor's or Master's degree in Computer Science or related field",
    "experiences": "5+ years of experience in software development",
    "contactInformation": {
      "phone": "+1-650-253-0000",
      "email": "jobs@google.com"
    }
  },
  {
    "id": 2,
    "companyLogo": "airbnb.png",
    "jobTitle": "Cloud Architect",
    "companyName": "Airbnb",
    "remoteOrOnsite": "Remote",
    "location": "Seattle, WA",
    "fulltimeOrPartTime": "Full-time",
    "salary": "$150,000 - $250,000",
    "jobDescription": "We are seeking an experienced Cloud Architect to lead our cloud infrastructure and strategy. The ideal candidate will have a deep understanding of cloud platforms such as AWS, Azure, or GCP, and will be able to design and implement scalable, secure, and highly available cloud-based systems. Strong communication skills and experience leading teams are essential.",
    "jobResponsibility": "As a Cloud Architect, you will be responsible for leading our cloud infrastructure and strategy. You should have a deep understanding of cloud platforms such as AWS, Azure, or GCP, and be able to design and implement scalable, secure, and highly available cloud-based systems. You will develop and implement cloud security and compliance policies, monitor and optimize cloud infrastructure for performance and cost-efficiency, and collaborate with cross-functional teams to gather requirements and design solutions. Strong communication skills and experience leading teams are essential.",
    "educationalRequirements": "Bachelor's or Master's degree in Computer Science or related field",
    "experiences": "7+ years of experience in cloud computing and infrastructure design",
    "contactInformation": {
      "phone": "+1-206-266-1000",
      "email": "jobs@amazon.com"
    }
  },
  {
    "id": 3,
    "companyLogo": "netflix.png",
    "jobTitle": "Product Manager",
    "companyName": "Netflix",
    "remoteOrOnsite": "Onsite",
    "location": "Redmond, WA",
    "fulltimeOrPartTime": "Full-time",
    "salary": "$140,000 - $200,000",
    "jobDescription": "We are looking for a talented Product Manager to lead the development of our software products. The ideal candidate will have experience managing product development lifecycles, from ideation to launch. You will work closely with cross-functional teams, including engineering, design, and marketing, to ensure the successful delivery of high-quality products that meet customer needs.",
    "jobResponsibility": "As a Product Manager, you will be responsible for leading the development of our software products. You will conduct market research and gather customer feedback to inform product development, collaborate with cross-functional teams, including engineering, design, and marketing, to ensure successful product delivery, develop and maintain product roadmaps and timelines, and monitor and analyze product performance and user feedback to inform product improvements and updates. Strong communication skills and experience managing product development lifecycles, from ideation to launch, are essential.",
    "educationalRequirements": "Bachelor's or Master's degree in Business Administration or related field",
    "experiences": "5+ years of experience in product management",
    "contactInformation": {
      "phone": "+1-425-882-8080",
      "email": "jobs@microsoft.com"
    }
  },
  {
    "id": 4,
    "companyLogo": "tesla.png",
    "jobTitle": "Senior iOS Developer",
    "companyName": "Tesla",
    "remoteOrOnsite": "Onsite",
    "location": "Cupertino, CA",
    "fulltimeOrPartTime": "Full-time",
    "salary": "$160,000 - $250,000",
    "jobDescription": "We are seeking an experienced Senior iOS Developer to join our mobile development team. The ideal candidate will have a strong background in iOS app development and a deep understanding of the latest iOS frameworks and technologies. You will work on a variety of projects, from designing and developing new apps to maintaining and improving existing ones. Strong communication skills and experience leading teams are essential.",
    "jobResponsibility": "As a Senior iOS Developer, you will be responsible for designing and developing iOS applications. You should have a strong background in iOS app development and a deep understanding of the latest iOS frameworks and technologies. You will work on a variety of projects, from designing and developing new apps to maintaining and improving existing ones. Strong communication skills and experience leading teams are essential.",
    "educationalRequirements": "Bachelor's or Master's degree in Computer Science or related field",
    "experiences": "5+ years of experience in product management",
    "contactInformation": {
      "phone": "+1-425-882-8080",
      "email": "jobs@microsoft.com"
    }
  },
  {
    "id": 5,
    "companyLogo": "microsoft.png",
    "jobTitle": "Data Scientist",
    "companyName": "Microsoft",
    "remoteOrOnsite": "Remote",
    "location": "Menlo Park, CA",
    "fulltimeOrPartTime": "Full-time",
    "salary": "$130,000 - $220,000",
    "jobDescription": "We are looking for a skilled Data Scientist to join our team. The ideal candidate will have expertise in data analysis and modeling, with experience working with large datasets and a variety of data sources. You will work closely with cross-functional teams to analyze data, develop insights, and drive data-driven decision-making. Strong communication skills and the ability to work collaboratively are essential.",
    "jobResponsibility": "As a Data Scientist, you will be responsible for analyzing data, developing insights, and driving data-driven decision-making. You should have expertise in data analysis and modeling, with experience working with large datasets and a variety of data sources. You will collaborate with cross-functional teams to analyze data, develop insights, and communicate findings to stakeholders. Strong communication skills and the ability to work collaboratively are essential.",
    "educationalRequirements": "Bachelor's or Master's degree in Computer Science, Mathematics, Statistics, or related field",
    "experiences": "5+ years of experience in data science or related field",
    "contactInformation": {
      "phone": "+1-650-543-4800",
      "email": "jobs@facebook.com"
    }
  },
  {
    "id": 6,
    "companyLogo": "linkedIn.png",
    "jobTitle": "UI/UX Designer",
    "companyName": "LinkedIn",
    "remoteOrOnsite": "Onsite",
    "location": "Sunnyvale, CA",
    "fulltimeOrPartTime": "Full-time",
    "salary": "$100,000 - $180,000",
    "jobDescription": "We are seeking a talented UI/UX Designer to join our design team. The ideal candidate will have experience designing user interfaces and experiences for web and mobile applications. You will work closely with cross-functional teams to understand user needs and create intuitive and engaging interfaces. Strong communication skills and the ability to work collaboratively are essential.",
    "jobResponsibility": "As a UI/UX Designer, you will be responsible for designing user interfaces and experiences for web and mobile applications. You will work closely with cross-functional teams to understand user needs and create intuitive and engaging interfaces. You should have experience designing user interfaces and experiences for web and mobile applications, with a strong understanding of design principles, tools, and technologies. Strong communication skills and the ability to work collaboratively are essential.",
    "educationalRequirements": "Bachelor's or Master's degree in Design, Human-Computer Interaction, or related field",
    "experiences": "3+ years of experience in UI/UX design",
    "contactInformation": {
      "phone": "+1-650-687-3600",
      "email": "jobs@linkedin.com"
    }
  }
]
